In [4]:
print("数据处理")
import pandas 
infos = pandas.read_csv("uber-raw-data-apr14.csv")
print(type(infos))
print(infos.dtypes)

数据处理
<class 'pandas.core.frame.DataFrame'>
Date/Time     object
Lat          float64
Lon          float64
Base          object
dtype: object

In [6]:
infos.head()
infos.tail()
print(infos.columns)

Index(['Date/Time', 'Lat', 'Lon', 'Base'], dtype='object')

In [8]:
infos.shape

(564516, 4)

In [15]:
print(infos.loc[[0, 5, 8]])

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
5  4/1/2014 0:33:00  40.7383 -74.0403  B02512
8  4/1/2014 0:55:00  40.7524 -73.9960  B02512

In [18]:
print("列")
lat_col = infos["Lat"]
lat_lon_col = infos[["Lat", "Lon"]]
print(lat_lon_col)

列
            Lat      Lon
0       40.7690 -73.9549
1       40.7267 -74.0345
2       40.7316 -73.9873
3       40.7588 -73.9776
4       40.7594 -73.9722
5       40.7383 -74.0403
6       40.7223 -73.9887
7       40.7620 -73.9790
8       40.7524 -73.9960
9       40.7575 -73.9846
10      40.7256 -73.9869
11      40.7591 -73.9684
12      40.7271 -73.9803
13      40.6463 -73.7896
14      40.7564 -73.9167
15      40.7666 -73.9531
16      40.7580 -73.9761
17      40.7238 -73.9821
18      40.7531 -74.0039
19      40.7389 -74.0393
20      40.7619 -73.9715
21      40.7530 -74.0042
22      40.6561 -73.9531
23      40.7250 -73.9844
24      40.6950 -74.1783
25      40.9859 -74.1578
26      40.6879 -74.1814
27      40.6878 -74.1816
28      40.7234 -73.9974
29      40.7336 -73.9900
...         ...      ...
564486  40.7342 -74.0101
564487  40.7412 -73.9792
564488  40.7633 -73.9867
564489  40.7549 -73.9845
564490  40.7210 -73.9850
564491  40.7025 -74.0127
564492  40.7568 -73.9848
564493  40.7446 -73.9837
564494  40.7013 -73.9367
564495  40.7213 -73.9948
564496  40.7587 -73.9723
564497  40.7325 -73.9969
564498  40.8152 -73.9433
564499  40.7643 -73.9868
564500  40.7650 -73.9773
564501  40.7436 -73.9848
564502  40.7313 -73.9940
564503  40.8007 -73.9565
564504  40.7603 -73.9870
564505  40.7419 -73.9866
564506  40.7316 -73.9891
564507  40.7267 -73.9937
564508  40.7788 -73.9600
564509  40.7420 -74.0037
564510  40.7514 -74.0066
564511  40.7640 -73.9744
564512  40.7629 -73.9672
564513  40.7443 -73.9889
564514  40.6756 -73.9405
564515  40.6880 -73.9608

[564516 rows x 2 columns]

In [20]:
col_names = infos.columns.tolist()
print(col_names)
lat_cols = []
for c in col_names:
    if c.endswith("Lat"):
        lat_cols.append(c)
lat_col = infos[lat_cols]
print(lat_col.head(3))

['Date/Time', 'Lat', 'Lon', 'Base']
       Lat
0  40.7690
1  40.7267
2  40.7316

In [25]:
infos.sort_values("Lat", inplace=True, ascending=False)
print(infos.tail())

                 Date/Time      Lat      Lon    Base
43493    4/2/2014 21:44:00  40.2259 -74.6235  B02598
268282  4/14/2014 18:43:00  40.2168 -74.5670  B02617
489976  4/23/2014 16:02:00  40.2026 -74.1224  B02682
378022   4/7/2014 10:31:00  40.1918 -74.6036  B02682
247368   4/8/2014 14:11:00  40.0729 -74.1638  B02617

In [26]:
titanic_survival = pandas.read_csv("train.csv")
titanic_survival.head(3)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [34]:
import numpy as np
age = titanic_survival["age"]
#print(age.loc[0:10])
age_is_null = pandas.isnull(age)
#print(age_is_null)
age_null_true = age[age_is_null]
age_null_count = len(age_null_true)
#print(age_null_count)

In [36]:
mean_age = sum(titanic_survival["age"])/ len(titanic_survival["age"])
print(mean_age)

nan

In [38]:
good_ages = titanic_survival["age"][age_is_null == False]
correct_mean_age = sum(good_ages) / len(good_ages)
print(correct_mean_age)

29.69911764705882

In [40]:
easy_mean = titanic_survival["age"].mean()
print("因为经常有缺失值，所以pandas有现成的函数， 但是并不是非常好的方法")
print(easy_mean)

因为经常有缺失值，所以pandas有现成的函数， 但是并不是非常好的方法
29.69911764705882

In [44]:
# mean fare for each class
passenger_classes = [1,2,3]
fare_by_classes = {}
for this_class in passenger_classes:
    pclass_rows = titanic_survival[titanic_survival["pclass"] == this_class]
    pclass_fares = pclass_rows["fare"]
    fare_for_class = pclass_fares.mean()
    fare_by_classes[this_class] = fare_for_class
print(fare_by_classes)

{1: 84.15468749999992, 2: 20.66218315217391, 3: 13.675550101832997}

In [46]:
# index tells the method which column to groupby
# values is the column that we want to apply the calculation to
# aggfunc specified the calculation we want to perform

passenger_survial = titanic_survival.pivot_table(index="pclass", values="survived", aggfunc=np.mean)
print(passenger_survial)

passenger_fare = titanic_survival.pivot_table(index="pclass", values="fare", aggfunc=np.mean)
print(passenger_fare)

        survived
pclass
1       0.629630
2       0.472826
3       0.242363
             fare
pclass
1       84.154687
2       20.662183
3       13.675550

In [47]:
drop_na_column = titanic_survival.dropna(axis=1)
print("如果在以下任何subset中有缺失， 会将整列移除")
new_titanic_survival= titanic_survival.dropna(axis=0, subset=["age", "sex"])

如果在以下任何subset中有缺失， 会将整列移除

In [49]:
row_index83_age = titanic_survival.loc[83, "age"]
print(row_index83_age)
row_index766_pclass = titanic_survival.loc[766, "pclass"]
print(row_index766_pclass)

28.0
1

In [54]:
new_titanic_survival = titanic_survival.sort_values("age", ascending = False)
#print(new_titanic_survival)
titanic_reindexed = new_titanic_survival.reset_index(drop=True)
print(titanic_reindexed.loc[0:10])

    survived  pclass                                  name   sex   age  sibsp  \
0          1       1  Barkworth, Mr. Algernon Henry Wilson  male  80.0      0
1          0       3                   Svensson, Mr. Johan  male  74.0      0
2          0       1               Artagaveytia, Mr. Ramon  male  71.0      0
3          0       1             Goldschmidt, Mr. George B  male  71.0      0
4          0       3                  Connors, Mr. Patrick  male  70.5      0
5          0       2           Mitchell, Mr. Henry Michael  male  70.0      0
6          0       1          Crosby, Capt. Edward Gifford  male  70.0      1
7          0       2                 Wheadon, Mr. Edward H  male  66.0      0
8          0       1        Ostby, Mr. Engelhart Cornelius  male  65.0      0
9          0       3                      Duane, Mr. Frank  male  65.0      0
10         0       1             Millet, Mr. Francis Davis  male  65.0      0

    parch      ticket     fare cabin embarked
0       0       27042  30.0000   A23        S
1       0      347060   7.7750   NaN        S
2       0    PC 17609  49.5042   NaN        C
3       0    PC 17754  34.6542    A5        C
4       0      370369   7.7500   NaN        Q
5       0  C.A. 24580  10.5000   NaN        S
6       1   WE/P 5735  71.0000   B22        S
7       0  C.A. 24579  10.5000   NaN        S
8       1      113509  61.9792   B30        C
9       0      336439   7.7500   NaN        Q
10      0       13509  26.5500   E38        S

In [55]:
# 自定义函数
def hundredth_row(column):
    hundredth_item = column.loc[99]
    return hundredth_item
hundredth_row = titanic_survival.apply(hundredth_row)
print(hundredth_row)

survived                    0
pclass                      2
name        Kantor, Mr. Sinai
sex                      male
age                        34
sibsp                       1
parch                       0
ticket                 244367
fare                       26
cabin                     NaN
embarked                    S
dtype: object

In [56]:
def null_count(column):
    column_null = pandas.isnull(column)
    null = column[column_null]
    return len(null)
column_null_count = titanic_survival.apply(null_count)
print(column_null_count)

survived      0
pclass        0
name          0
sex           0
age         177
sibsp         0
parch         0
ticket        0
fare          0
cabin       687
embarked      2
dtype: int64

In [ ]:
 def which_class(row):
        pclass = row['pclass']
        if pandas.isnull(pclass):
            return "Unkown"
        elif pclass == 1:
            return "First Class"
        elif pclass == 2:
            return "Second Class"
        elif pclass == 2:
            return "Third Class"

classes = titanic_survival.apply(which_class, axis=1)
print(classes)